# Словарь биомаркеров (из вашего JSON)
biomarkers_dict = {
  "Глюкоза": {
    "id": 1,
    "синонимы": ["Глюкоза", "Глюкоза сывороточная", "Сахар", "Сахар в крови", "Декстроза", "Глюкоза плазмы"]
  },
  "Мочевина": {
    "id": 2,
    "синонимы": ["Мочевина", "Азот мочевины", "Остаточный азот крови", "Небелковый азот крови", "Urea", "BUN (Blood Urea Nitrogen)"]
  },
  "Креатинин": {
    "id": 3,
    "синонимы": ["Креатинин", "Creatinine", "Креатинин сывороточный"]
  },
  "Общий холестерин": {
    "id": 4,
    "синонимы": ["Общий холестерин", "Cholesterol", "Холестерин", "Холестерол", "Total Cholesterol"]
  },
  "ЛПНП": {
    "id": 5,
    "синонимы": ["Холестерин ЛПНП", "Холестерин-ЛПНП", "Х-ЛПНП", "Х ЛПНП", "ХС ЛПНП", "Липопротеины низкой плотности", "Плохой холестерол", "LDL", "Low-Density Lipoprotein"]
  },
  "ЛПВП": {
    "id": 6,
    "синонимы": ["Холестерин ЛПВП", "Холестерин-ЛПВП", "Х-ЛПВП", "Х ЛПВП", "ХС ЛПВП", "Липопротеины высокой плотности", "HDL", "High-Density Lipoprotein", "Хороший холестерол"]
  },
  "ЛПОНП": {
    "id": 7,
    "синонимы": ["Холестерин ЛПОНП", "Холестерин-ЛПОНП", "Х-ЛПОНП", "Х ЛПОНП", "ХС ЛПОНП", "Липопротеины очень низкой плотности", "VLDL", "Very Low-Density Lipoprotein"]
  },
  "Триглицериды": {
    "id": 8,
    "синонимы": ["Триглицериды", "Trig", "ТГ", "Triglycerides", "Липиды"]
  },
  "Фосфолипиды": {
    "id": 9,
    "синонимы": ["Фосфолипиды", "Phospholipids"]
  },
  "Билирубин общий": {
    "id": 10,
    "синонимы": ["Общий билирубин", "Total Bilirubin", "TBIL"]
  },
  "Билирубин прямой": {
    "id": 11,
    "синонимы": ["Прямой билирубин", "Связанный билирубин", "Конъюгированный билирубин", "Direct Bilirubin", "DBIL"]
  },
  "Билирубин непрямой": {
    "id": 12,
    "синонимы": ["Непрямой билирубин", "Свободный билирубин", "Неконъюгированный билирубин", "Indirect Bilirubin", "IBIL"]
  },
  "Дополнительные билирубины": {
    "id": 13,
    "синонимы": ["Билирубин", "Моноглюкоронид", "Диглюкоронид", "Билирубин-глюкуронид"]
  },
  "Общий белок": {
    "id": 14,
    "синонимы": ["Общий белок", "Total Protein", "TP"]
  },
  "Альбумин": {
    "id": 15,
    "синонимы": ["Альбумин", "Albumin", "ALB"]
  },
  "Альфа-1-глобулины": {
    "id": 16,
    "синонимы": ["Альфа-1-глобулины", "Alpha-1-globulins"]
  },
  "Альфа-2-глобулины": {
    "id": 17,
    "синонимы": ["Альфа-2-глобулины", "Alpha-2-globulins"]
  },
  "Бета-глобулины": {
    "id": 18,
    "синонимы": ["Бета-глобулины", "Beta-globulins"]
  },
  "Гамма-глобулины": {
    "id": 19,
    "синонимы": ["Гамма-глобулины", "Gamma-globulins"]
  },
  "АСТ": {
    "id": 20,
    "синонимы": ["АсАт", "АСТ", "AST", "ACТ", "Аспартатаминотрансфераза", "Аспартат-аминотрансфераза", "Aspartate Aminotransferase"]
  },
  "АЛТ": {
    "id": 21,
    "синонимы": ["АлАт", "АЛТ", "ALT", "Аланинаминотрансфераза", "Аланин-аминотрансфераза", "Alanine Aminotransferase"]
  },
  "Щелочная фосфатаза": {
    "id": 22,
    "синонимы": ["Щелочная фосфатаза", "ALP", "Alkaline Phosphatase"]
  },
  "Липаза": {
    "id": 23,
    "синонимы": ["Липаза", "Lipase", "LPS"]
  },
  "Амилаза": {
    "id": 24,
    "синонимы": ["Амилаза", "Альфа-амилаза", "Amylase", "AMY"]
  },
  "Гамма-ГТ": {
    "id": 25,
    "синонимы": ["Гамма-ГТП", "Гамма-глутамилтранспептидаза", "Гамма-глютаминтранспептидаза", "Глютаминтранспептидаза", "ГГТ", "Гамма-ГТ", "GGT", "Gamma-Glutamyl Transferase"]
  },
  "ЛДГ": {
    "id": 26,
    "синонимы": ["Лактатдегидрогеназа", "Лактат дегидрогеназа", "ЛДГ", "ЛДГ-1 фракция", "aHBDH", "Lactate Dehydrogenase", "LDH", "Lac"]
  },
  "Креатинкиназа": {
    "id": 27,
    "синонимы": ["Креатинфосфокиназа", "Креатинкиназа", "КФК", "Креатинкиназа-МБ", "CK", "Creatine Kinase", "CK-MB"]
  },
  "Кальций": {
    "id": 28,
    "синонимы": ["Кальций", "Кальций общий", "Кальций ионизированный", "Calcium", "Ca"]
  },
  "Калий": {
    "id": 29,
    "синонимы": ["Калий", "Potassium", "K"]
  },
  "Натрий": {
    "id": 30,
    "синонимы": ["Натрий", "Sodium", "Na"]
  },
  "Хлор": {
    "id": 31,
    "синонимы": ["Хлор", "Хлориды", "Chloride", "Cl","CI-"]
  },
  "Железо": {
    "id": 32,
    "синонимы": ["Железо", "Сывороточное железо", "Iron", "Fe"]
  },
  "Ферритин": {
    "id": 33,
    "синонимы": ["Ферритин", "Ferritin"]
  },
  "Трансферрин": {
    "id": 34,
    "синонимы": ["Трансферрин", "Transferrin"]
  },
  "Витамин D": {
    "id": 35,
    "синонимы": ["Витамин 25(OH) D", "25-OH витамин D", "25-Hydroxyvitamin D", "Витамин D3", "Холекальциферол"]
  },
  "Магний": {
    "id": 36,
    "синонимы": ["Магний", "Magnesium", "Mg"]
  },
  "Фосфор": {
    "id": 37,
    "синонимы": ["Фосфор", "Phosphorus", "P"]
  },
  "Цинк": {
    "id": 38,
    "синонимы": ["Цинк", "Zinc", "Zn"]
  },
  "Селен": {
    "id": 39,
    "синонимы": ["Селен", "Selenium", "Se"]
  },
  "Медь": {
    "id": 40,
    "синонимы": ["Медь", "Copper", "Cu"]
  }
}